:PROPERTIES:
:ID:       5af34b29-a493-4e5c-8c57-51c1892fa295
:END:
#+title: Rust Meetup Talk Newtype Pattern Trait / Deref Trait
#+email: s@stfl.dev
#+author: Stefan Lendl

* Use it as a Parameter Type

#+begin_src rust :include '(product products_alias)
fn name_of_most_expensive(ps: &Products) -> Option<&str> {
    ps.iter()  // Use Products as Vec<Product>
      .max_by_key(|p| p.price)
      .map(|p| &*p.name)
}

let ps = vec![
    Product {name: String::from("Banana"), price: 1},
    Product {name: String::from("Pizza"), price: 8},
    Product {name: String::from("Beer"), price: 2},
    Product {name: String::from("Mate"), price: 2},
];

println!("{:?}", name_of_most_expensive(&ps));
#+end_src

#+RESULTS:
: Some("Pizza")

* Tuple Struct (cont.)

#+begin_src rust :include '(product products_impl)
let ps = Products(vec![
    Product {name: String::from("Banana"), price: 1},
    Product {name: String::from("Pizza"), price: 8},
    Product {name: String::from("Beer"), price: 2},
    Product {name: String::from("Mate"), price: 2},
]);

println!("{:?}", ps.name_of_most_expensive());
#+end_src

#+RESULTS:
: Some("Pizza")

* Implement External Trait (cont.)

#+begin_src rust :include '(product products_impl products_fmt)
let ps = Products(vec![
    Product {name: String::from("Banana"), price: 1},
    Product {name: String::from("Pizza"), price: 8},
    Product {name: String::from("Beer"), price: 2},
    Product {name: String::from("Mate"), price: 2},
]);

println!("{}", ps);
#+end_src

#+RESULTS:
: Banana(1€), Pizza(8€), Beer(2€), Mate(2€)

* Best of Both Worlds

#+begin_src rust :include '(product products_impl products_deref)
let ps = Products(vec![
    Product {name: String::from("Banana"), price: 1},
    Product {name: String::from("Pizza"), price: 8},
    Product {name: String::from("Beer"), price: 2},
    Product {name: String::from("Mate"), price: 2},
]);

let sum: i32 = ps.iter().map(|p| p.price).sum();
println!("{}", sum);

fn name_of_most_expensive(ps: &Products) -> Option<&str> {
    ps.iter()  // Implicit deref()
      .max_by_key(|p| p.price)
      .map(|p| &*p.name)
}

println!("{:?}", name_of_most_expensive(&ps));
#+end_src

#+RESULTS:
: 13
: Some("Pizza")

* Dot Operator

Dot operator implicitly calls deref on references.

#+begin_src rust :include '(product)
let p = Product {name: String::from("Banana"), price: 1};
let pr = &p;

println!("{}", p.name);
println!("{}", pr.name);  // instead of (*pr).name
println!("{}", p.name == pr.name);
#+end_src

#+RESULTS:
: Banana
: Banana
: true

* Deref Coercions
:PROPERTIES:
:SOURCE: https://doc.rust-lang.org/book/ch15-02-deref.html#implicit-deref-coercions-with-functions-and-methods
:END:

#+begin_quote
Deref coercion converts a reference to a type that implements the Deref trait
into a reference to another type.
Deref coercion is a convenience Rust performs on arguments to functions and
methods, and works only on types that implement the Deref trait.
#+end_quote

Use a &String and &str interchangably in parameters.

#+begin_src rust
fn i_am(name: &str) {
    println!("I am, {name}!");
}

i_am("a &str");
i_am(&String::from("a &String"));
#+end_src

#+RESULTS:
: I am, a &str!
: I am, a &String!

* Deref Coercion (cont.)

#+begin_src rust :include '(product products_impl products_deref)
let ps = Products(vec![
    Product {name: String::from("Banana"), price: 1},
    Product {name: String::from("Pizza"), price: 8},
    Product {name: String::from("Beer"), price: 2},
    Product {name: String::from("Mate"), price: 2},
]);

fn name_of_most_expensive(ps: &Vec<Product>) -> Option<&str> {
    ps.iter()  // Implicit deref()
      .max_by_key(|p| p.price)
      .map(|p| &*p.name)
}

println!("{:?}", name_of_most_expensive(&ps));
#+end_src

#+RESULTS:
: Some("Pizza")

* Using Box<T>

#+begin_src rust
let b = Box::new(123);
println!("{b}");
#+end_src

#+RESULTS:
: 123

Using Box<T> like a reference

#+begin_src rust
let a = 123;
let b = Box::new(a);  // a is copied into the Box

println!("{}", a == *b);
#+end_src

#+RESULTS:
: true

